Revit 2027 API
DirectContext3DHandleOverrides.SetDirectContext3DHandleSettings Method
 Assigns override settings associated with a DirectContext3D handle instance or type.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDirectContext3DHandleSettings(
	Document aDoc,
	ElementId elementId,
	DirectContext3DHandleSettings newSettings
)
Public Sub SetDirectContext3DHandleSettings (
	aDoc As Document,
	elementId As ElementId,
	newSettings As DirectContext3DHandleSettings
)
public:
void SetDirectContext3DHandleSettings(
	Document^ aDoc,
	ElementId^ elementId,
	DirectContext3DHandleSettings^ newSettings
)
member SetDirectContext3DHandleSettings :
        aDoc : Document *
        elementId : ElementId *
        newSettings : DirectContext3DHandleSettings -> unit
Parameters
aDoc Document
 Document where elementId resides.
elementId ElementId
 Id of the element to be overridden.
newSettings DirectContext3DHandleSettings
 The override settings to be assigned to the handle element.
Exceptions
Exception | Condition
ArgumentException |  The ElementId elementId is not a valid DirectContext3D handle instance or type.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectContext3DHandleOverrides Class
Autodesk.Revit.DB.DirectContext3D Namespace